[
{
"appliedCandidates": [],
"_id": "6127487386f681465cdaf9f3",
"title": "Software Engineer Fall Intern",
"jobType": "Industry",
"employeeType": "Intern",
"minimumQualification": "Currently enrolled in college/university and must have at least one semester/term/quarter of school left to complete after the end of the co-op. Must be eligible and available for a full-time (40h / week) 6-month co-op between June to December 2022.",
"preferredQualification": "Experience with creative problem solving and articulating technical challenges and solutions. Exposure to any of the following concepts: AWS and other Web Technologies, schedulers, workflows, state machines, multi-threading, and networking protocols. Interest in Robotics, including coursework or clubs.",
"description": "We are looking for a passionate, hard-working, and talented Software Development Engineer to join our Boston Amazon Robotics team who can build innovative & mission critical system software applications & tools.",
"responsibility": "Collaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market. Design and build innovative technologies in a large distributed computing environment, and help lead fundamental changes in the industry. Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed. Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use. Ability to design and code the right solutions starting with broadly defined problems. Work in an agile environment to deliver high-quality software.",
"company": "Amazon Robotics",
"email": "amazontalents@gmail.com",
"postedBy": "6122434efdc7c27220f485d8",
"companyDescription": "Amazon Robotics, a wholly owned subsidiary of Amazon.com, empowers a smarter, faster, more consistent customer experience through automation. Amazon Robotics automates fulfillment center operations using various methods of robotic technology including autonomous mobile robots, sophisticated control software, language perception, power management, computer vision, depth sensing, machine learning, object recognition, and semantic understanding of commands. Amazon Robotics has a dedicated focus on research and development to continuously explore new opportunities to extend its product lines into new areas.",
"mentorDescription": "",
"createdAt": "2022-04-05T07:53:23.437Z",
"updatedAt": "2022-04-06T17:22:27.540Z"

},
{
"appliedCandidates": [],
"_id": "6127487b86f681465cdaf9f4",
"title": "Research Intern, PhD, Summer 2022",
"jobType": "Industry",
"employeeType": "Intern",
"minimumQualification": "Currently enrolled in a PhD degree in Computer Science, Linguistics, Statistics, Biostatistics, Applied Mathematics, Operations Research, Economics, Natural Sciences, or a related technical field. Experience in one area of computer science (e.g., Natural Language Understanding, Computer Vision, Machine Learning, Deep Learning, Algorithmic Foundations of Optimization, Quantum Information Science, Data Science, Software Engineering, or a similar area.).",
"preferredQualification": "Currently attending a degree program in the US. Availability to work full-time for a minimum of 12 weeks outside of university term. Ability to return to a degree program after completion of the internship. Relevant experience as a researcher, including internships, full-time, or at a lab. Experience contributing research communities or efforts, including publishing papers in major conferences or journals. Experience with one or more general purpose programming languages. Ability to speak and write in English fluently.",
"description": "We are looking for three self-motivated PhDs with solid machine learning background to join our Kirkland Google Research team.",
"responsibility": "Develop and execute a research agenda. Create and support a productive and innovative team, including working with peers, managers, and teams.",
"company": "Google Research",
"email": "googlers@gmail.com",
"postedBy": "6122434efdc7c27220f485d8",
"companyDescription": "Google Research addresses challenges that define the technology of today and tomorrow. From conducting fundamental research to influencing product development, our research teams have the opportunity to impact technology used by billions of people every day.",
"mentorDescription": "",
"createdAt": "2022-01-24T07:53:23.437Z",
"updatedAt": "2022-01-21T17:22:27.540Z"

},
{
"appliedCandidates": [],
"_id": "6127488386f681465cdaf9f7",
"title": "Data & Applied Scientist",
"jobType": "Industry",
"employeeType": "Full Time",
"minimumQualification": "5+ yrs. experience in computer vision and machine learning. 3+ yrs. programming experience in C#, C++ (preferable), or Java with solid engineering practices. 3+ yrs. programming experience in Python (preferable), or other scripting languages. 2+ yrs. experience with at least one of the public deep learning toolkits such as PyTorch or TensorFlow. ",
"preferredQualification": "Master or PhD (or candidates) in CS or related areas with focus in one or more of engineering, computer vision, or machine learning. Software development skills and aptitude for software design, coding and quality. Experience with docker and Kubernetes is a plus.  ",
"description": "Azure Computer Vision service (Computer Vision | Microsoft Azure) empowers customers to build end-to-end solution in industry verticals using state-of-the-art computer vision technology. We are a growing team of talented engineers and scientists. Come and join us to create this future!",
"responsibility": "Innovate and Build products customers love is our mission! You will build an industry leading computer vision customization service as part of Azure cognitive service for both cloud and edge platform. You will find great R&D opportunities to develop state-of-the-art algorithms in computer vision model customization. You will communicate with customers directly and drive customer experience improvements end to end. You will work as part of a team that brings together talent in the areas of software engineering, computer vision, and machine learning.",
"company": "Microsoft",
"email": "msreferral@outlook.com",
"postedBy": "6122434efdc7c27220f485d8",
"companyDescription": "Microsoft is the largest vendor of computer software in the world. It is also a leading provider of cloud computing services, video games, computer and gaming hardware, search and other online services.",
"mentorDescription": "",
"createdAt": "2022-05-31T07:53:23.437Z",
"updatedAt": "2022-06-02T17:22:27.540Z"

},
{
"appliedCandidates": [],
"_id": "6127488b86f681465cdaf9f9",
"title": "Quantitative UX Research Manager",
"jobType": "Industry",
"employeeType": "Full Time",
"minimumQualification": "4 or more years of experience with consumer or enterprise products, consumer or employee insights, or product development. 10 or more years of experience with user research, quantitative research. 2 or more years of experience directly managing, coaching and developing full-time quantitative researchers. Track record of translating research into design and product. Proven track record of building and managing high-performing quant research teams, with researchers of different levels of seniority.",
"preferredQualification": "Experience leading research for enterprise applications. Understanding or experience working on finance applications. Experience documenting complex processes and workflows. Experience managing senior researchers.",
"description": "Meta is looking for a Quantitative UX Research Manager with proven research, communication and people management skills.",
"responsibility": "Guide quantitative research throughout the product life-cycle from early stage generative research, through iterative concept or prototype testing, and post-launch measurement. Build a measurement strategy and roadmap for a product pillar. Build and influence meaningful cross-functional relationships. Deliver actionable and relevant insights aligned to both strategic and tactical product and designs decisions. Identify and prioritize short-term and long-term research that delivers impact. Allocate resources to ensure we are always focusing on the highest priority things, focusing both on the short term needs as well as looking ahead to the next big challenge. Hire, develop, and retain talent. Advocate passionately for the customer, ensuring that the product experience is aligned to user needs and expectations.",
"company": "Meta",
"email": "metatofb@gmail.com",
"postedBy": "6122434efdc7c27220f485d8",
"companyDescription": "Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world.",
"mentorDescription": "",
"createdAt": "2021-12-12T07:53:23.437Z",
"updatedAt": "2021-12-13T17:22:27.540Z"

},
{
"appliedCandidates": [],
"_id": "6127489186f681465cdaf9fb",
"title": "ML/AI Full Scholarships PhD Positions, Fall 2022/Spring 2023",
"jobType": "Academia",
"employeeType": "Full Time",
"minimumQualification": "BS/MS in Computer Science, Electrical Engineering, Applied Mathematics, Information Systems, or other related technical fields. Strong curiosity for research.",
"preferredQualification": "Background with computer science and mathematics is a plus",
"description": "The research group of Zhizhi Chen, Department of Computer Science and Engineering, Mississippi State University, plans to admit full-award PhD students in the field of graph machine learning.",
"responsibility": "",
"company": "Mississippi State University",
"email": "zchen@cse.msstate.edu",
"postedBy": "6122434efdc7c27220f485d8",
"companyDescription": "Founded in 1878, Mississippi State University is a comprehensive university with a long history located in Mississippi, USA. It is a R1 university. It is ranked 93rd in the U.S. News and World Report rankings of public universities in the United States, and the School of Engineering is ranked in the top 90 in the United States. The main research directions of the Department of Computer Science and Engineering include artificial intelligence, computational science (with the fourth supercomputer in the US academia), visualization and graphics, bioinformatics, parallel and distributed computing, software engineering, human-computer interaction, virtual and augmented reality, security and cryptography, and computer education. Faculty members are also active in major centers such as the Center for Advanced Vehicular Systems, the Center for Cyber ​​Innovation, the Center for Computational Science, the Institute for Genomics, Biocomputing & Biotechnology, etc. Its computer security field is designated as a National Center of Academic Excellence in Information Assurance Education (CAEIAE) by the National Security Agency.",
"mentorDescription": "Zhizhi chen is an Assistant Professor in the Computer Science and Engineering Department of Mississippi State University. Before joining MS State in 2020, he have been working as a research assistant at Virginia Tech. He received an outstanding contribution award from Toyota Research North America in 2016. Currently, He am focusing on graph machine learning and its applications on spatial problems, circuit, molecule, etc.",
"createdAt": "2022-04-26T07:53:23.437Z",
"updatedAt": "2022-04-26T17:22:27.540Z"

},
{
"appliedCandidates": [],
"_id": "6127489986f681465cdaf9fd",
"title": "NLP Summer Intern(Remote) 2022@LanguageX Lab, Temple University",
"jobType": "Academia",
"employeeType": "Intern",
"minimumQualification": "Passion for NLP. Intention to apply for PhD in NLP",
"preferredQualification": "Have own computing resources like GPU(Optional). Can work ASAP",
"description": "The LanguageX Lab of Temple University is looking for two talented students who have passion for NLP.",
"responsibility": "",
"company": "LanguageX Lab, Temple University",
"email": "wenpeng.yin@temple.edu",
"postedBy": "6122434efdc7c27220f485d8",
"companyDescription": "LanguageX lab tries to advance the frontiers of language processing and understanding.",
"mentorDescription": "Wenpeng Yin is a tenure-track Assistant Professor in the Department of Computer & Information Sciences at Temple University, where he leads the LanguageX lab.",
"createdAt": "2022-05-14T07:53:23.437Z",
"updatedAt": "2022-05-15T17:22:27.540Z"

},
{
"appliedCandidates": [],
"_id": "61275b752b2484175011fd20",
"title": "PhD Research Intern Positions@UMD ECE",
"jobType": "Academia",
"employeeType": "Intern",
"minimumQualification": "BS/MS in CS/EE/IS/Math/Stat/OR or other related technical fields",
"preferredQualification": "Passion for research",
"description": "I am looking for students who are interested in machine learning, edge computing, and security and privacy to join my research work.",
"responsibility": "",
"company": "Department of Electrical and Computer Engineering, The University of Maryland, College Park",
"email": "ang.li630@duke.edu",
"postedBy": "6122434efdc7c27220f485d8",
"companyDescription": "UMD ECE is a large department that offers a broad range of programs and research opportunities. Its research innovations are aimed at helping government and industry face today's most difficult global challenges. Employers and peer institutions recognize the prestige of Maryland's engineering programs.",
"mentorDescription": "Dr. Ang Li will join the Department of Electrical and Computer Engineering at University of Maryland (College Park) in Fall 2023. He is currently a Research Associate in Qualcomm AI, and he obtained his Ph.D. from Duke University under the supervision of Prof. Yiran Chen. His research has been published in top-tier system/networking and AI/data mining conferences including MobiCom, SenSys, IPSN, MobiHoc, INFOCOM, NeurIPS, CVPR, and KDD. His work has received several awards, including 2020 KDD Best Student Paper Award and 2019 SEC Best Student Poster Award. He is now recruiting multiple Ph.D. students (starting in Fall 2023) master students, and research interns to conduct research in machine learning, edge computing, security and privacy.",
"createdAt": "2022-05-31T07:53:23.437Z",
"updatedAt": "2022-06-01T17:22:27.540Z"

},
{
"appliedCandidates": [],
"_id": "612a6e6ff52518b6c47cf128",
"title": "Postdoctoral Researcher Positions, Tulane University",
"jobType": "Academia",
"employeeType": "Full Time",
"minimumQualification": "Solid background in Computer Science or Informatics. Experience coding in one or more of C, C++, Java, JavaScript, Python, or similar.",
"preferredQualification": "Ability to speak and write in English fluently",
"description": "I plant to look for two full-scholarship granted postdoctoral researchers for Spring or Fall 2023",
"responsibility": "Conduct research in Algorithm Design. Machine Learning, Genomics, and Proteomics",
"company": "Xiaowen (Kevin) Liu's Lab, Tulane University",
"email": "xwliu@tulane.edu",
"postedBy": "6122434efdc7c27220f485d8",
"companyDescription": "Founded in 1834, Tulane University is a research university, which is located in New Orleans, Louisiana, United States. It is a member of the American Association of Universities (AAU). It is ranked 41st in the 2021 U.S. News ranking of American universities. New Orleans, where the university is located, has a warm climate, cultural diversity and suitable for living.",
"mentorDescription": "Dr. Liu received his bachelor’s (1996) and master’s (2004) degrees in computer science from Shandong University, China and obtained his Ph.D. degree (2008) in computer science from City University of Hong Kong, Hong Kong. After 4-year postdoc training at the University of Western Ontario, the University of Waterloo, and the University of California, San Diego, Dr. Liu took positions as an Assistant Professor and Associate Professor at the Department of BioHealth Informatics, Indiana University-Purdue University Indianapolis from 2012 to 2021.  Dr. Liu is currently a professor of bioinformatics in the Division of Biomedical Informatics and Genomics, John W. Deming Department of Medicine, Tulane University School of Medicine.",
"createdAt": "2022-05-31T07:53:23.437Z",
"updatedAt": "2022--06-02T17:22:27.540Z"

}
]